[
{"title": "Mayhem – Liturgy Of Death (Century Media Records)", "content": "It took more than 6 years for black metal legends Mayhem to follow the excellent Daemon, yet, somehow, that time felt shorter because of the band’s relentless touring schedule. The lineup has remained stable since 2012 and for a third consecutive studio album now and the way these people form a collaborative musical entity, is […]", "link": "https://www.velvetthunder.co.uk/mayhem-liturgy-of-death-century-media-records/", "source": "VELVET THUNDER"},
{"title": "Walk In Darkness – Gods Dont Take Calls", "content": "I’ve said it before, and I’ve no doubt I’ll find myself asking this again – what is it about so many Italian bands? They seem to share an innate sense of the Operatic, to effortlessly lure you into a gothic/symphonic soundscape that entrances with a natural sense of atmosphere regardless of the actual instrumentation. In […]", "link": "https://www.velvetthunder.co.uk/walk-in-darkness-gods-dont-take-calls/", "source": "VELVET THUNDER"},
{"title": "MYRATH ANNOUNCE NEW SINGLE AND UPCOMING ALBUM", "content": "Tunisian–French metal innovators Myrath release their new single Soul Of My Soul, a deeply emotional and intimate song about love, loss, and the bond that survives beyond time and absence. Rather than mourning what is gone, the band explores memory as something eternal – a presence that lingers in every breath, every silence, every corner […]", "link": "https://www.velvetthunder.co.uk/myrath-announce-new-single-and-upcoming-album/", "source": "VELVET THUNDER"},
{"title": "ZEN ORCHESTRA – Zen Orchestra (Sound Stuff Records)", "content": "Basically, if you like that classic neo-prog sound, but not to the exclusion of all else, this will be an album you can approach with confidence … It’s just the right digestible length for a one-sitting listen, and never outstays its welcome – and yes, it is a fine and fitting memorial to Stewart Milner. […]", "link": "https://www.velvetthunder.co.uk/zen-orchestra-zen-orchestra-sound-stuff-records/", "source": "VELVET THUNDER"},
{"title": "Big Big Train about to release new album “Woodcut”, final single out now", "content": "Big Big Train, the award-winning, progressive rock band, will issue their 16th studio album via InsideOutMusic on 6th February 2026. ‘Woodcut’ is a landmark release for the group, whose line-up draws together members from England, Scotland, Italy, the USA, Sweden and Norway, in that it marks their first ever full-length conceptual piece – quite a statement given […]", "link": "https://www.velvetthunder.co.uk/big-big-train-about-to-release-new-album-woodcut-final-single-out-now/", "source": "VELVET THUNDER"},
{"title": "UK heavy rock/prog band Godsticks announce new album ‘VOiD’ / Released 27th March (Kscope)", "content": "UK-based heavy proggers Godsticks have announced their long awaited seventh studio album and the follow up to 2023’s lauded This Is What A Winner Looks Like. The new album, titled VOiD, is Godsticks’ darkest, heaviest, and most uncompromising album to date. Both lyrically and musically, VOiD reflects a disillusionment with a world increasingly defined by division, ideological rigidity, and the loss of […]", "link": "https://www.velvetthunder.co.uk/uk-heavy-rock-prog-band-godsticks-announce-new-album-void-released-27th-march-kscope/", "source": "VELVET THUNDER"},
{"title": "Camel – Earthrise: Live at the Marquee 1974 (Esoteric/Cherry Red)", "content": "Camel weren’t just a pretty-sounding band… they had a rhythmic muscle that later prog bands often lacked. No word of a lie here, and with no exaggeration: I can’t think of a single band from the world of 70s rock that I consider more underrated than Camel. An awfully bold way to lead off, I […]", "link": "https://www.velvetthunder.co.uk/camel-earthrise-live-at-the-marquee-1974-esoteric-cherry-red/", "source": "VELVET THUNDER"},
{"title": "Megadeth – Megadeth (BLKIIBLK)", "content": "Four decades seem like eternity when we speak of thrash, which is one of the most demanding metal genres both technically and physically. When we talk about Megadeth, which has always composed at an extremely high performance level, then it’s not surprising the legendary Dave Mustaine is calling it quits with a final self-titled album […]", "link": "https://www.velvetthunder.co.uk/megadeth-megadeth-blkiiblk/", "source": "VELVET THUNDER"}
]
