[
{"title": "Kid Kapichi – ‘Fearless Nature’ Album Launch @ Headrow House, Leeds", "content": "", "link": "https://www.punktastic.com/galleries/kid-kapichi-fearless-nature-album-launch-headrow-house-leeds/", "source": "Punktastic"},
{"title": "Jagged City – ‘THERE ARE MORE OF US, ALWAYS’", "content": "Baking a cake is a simple thing. Two eggs, two hundred grams of flour, sugar and margarine, all mixed together and gently cooked for thirty minutes. An easy recipe. The results are fairly consistent, you know what you’ll get, but if you change those ingredients things become more interesting. Add grated carrot or courgette and […]", "link": "https://www.punktastic.com/album-reviews/jagged-city-there-are-more-of-us-always/", "source": "Punktastic"},
{"title": "LIVE: The Wonder Years / Free Throw @ O2 Forum Kentish Town", "content": "Delayed mourning hangs in the atmosphere at O2 Forum Kentish Town. The Wonder Years are at the end of their four date run of the UK to celebrate the re-issue of ‘No Closer To Heaven’, and after their spring US tour they’ll be going on an indefinite hiatus. Of course, there’s plenty of bands who’ve […]", "link": "https://www.punktastic.com/live-reviews/live-the-wonder-years-free-throw-o2-forum-kentish-town/", "source": "Punktastic"},
{"title": "Sick Joy – ‘MORE FOREVER’", "content": "Anticipation is a terrible thing. Anticipation breeds disappointment. So, when Sick Joy announced their first album in three years, it would make sense not to be excited. It would be a bad idea to listen to their incredible ‘Them Days’ EP – or to their debut album ‘We’re All Going To F**king Die’ – and […]", "link": "https://www.punktastic.com/album-reviews/sick-joy-more-forever/", "source": "Punktastic"},
{"title": "Shields – ‘DEATH & CONNECTION’", "content": "If you listen to a lot of contemporary metalcore records, you develop a certain weariness; a low tolerance for trends, copying, spot-the-difference and heard-it-before sounds that leave you wishing for something different. Shields then send you their new record and, well, you asked for it. Shields are not a new band. They folded back in […]", "link": "https://www.punktastic.com/album-reviews/shields-death-connection/", "source": "Punktastic"},
{"title": "The Hara – ‘The Fallout’", "content": "The Hara are back with their sophomore studio record, and they’re funnelling their fire into personal resistance. Well, “back” is a bit of a stretch as they’ve been releasing a steady string of singles since they dropped ‘Survival Mode’ back in 2023, constantly delivering high energy live shows in the meantime. The good news is […]", "link": "https://www.punktastic.com/album-reviews/the-hara-the-fallout/", "source": "Punktastic"},
{"title": "Kid Kapichi – ‘Fearless Nature’", "content": "It feels like we’re all Kid Kapichi. Roaring out of the pandemic years with their 2021 debut through their political disillusionment and galvanisation of their next two releases, Jack Wilson and Eddie Lewis have channelled our zeitgeist into jagged, quick-witted tunes. ‘Fearless Nature’ sees the duo turning a corner, and it’s one that may prove […]", "link": "https://www.punktastic.com/album-reviews/kid-kapichi-fearless-nature/", "source": "Punktastic"},
{"title": "I Promised The World – ‘I PROMISED THE WORLD’", "content": "Okay –I Promise The World are a young, upcoming metalcore band, freshly signed to Rise Records and they’re are starting 2026 with a new self-titled EP. So far, so good, but what makes them unusual is that their sound is heavily indebted to 2006 – like, everything about it could be lifted from mainstream screamo […]", "link": "https://www.punktastic.com/album-reviews/i-promised-the-world-i-promised-the-world/", "source": "Punktastic"},
{"title": "Twenty One Children: After the Storm – EP Review", "content": "Twenty One Children – After the Storm EP (Slovenly Recordings) CD | DL Out Now Lo-fi trashy hardcore from the streets of Soweto with an 80s US punk influence.  Nathan Brown reviews. Mention Soweto and (depending on their age) people’s first reach will be the township uprisings against apartheid or the World Cup, not punk […]\nThe post Twenty One Children: After the Storm – EP Review appeared first on Louder Than War.", "link": "https://louderthanwar.com/twenty-one-children-after-the-storm-ep-review/", "source": "Louder Than War"},
{"title": "Brown Horse: Birmingham Sunflower Lounge – Live Review", "content": "Brown Horse | Ollie Cook And The Hogwash Birmingham Sunflower Lounge 27th January 2026 As part of Independent Venue Week, one of independent music’s most strident acts brings their live sound to one of the UK’s most iconic small venues. Sam Lambeth reviews. Nothing fills your heart quicker than seeing a small venue packed to […]\nThe post Brown Horse: Birmingham Sunflower Lounge – Live Review appeared first on Louder Than War.", "link": "https://louderthanwar.com/brown-horse-birmingham-sunflower-lounge-live-review/", "source": "Louder Than War"},
{"title": "The Band Of Holy Joy: celebrating their 40 years of recordings (part three)", "content": "The Band Of Holy Joy: celebrating their 40 years of recordings (Part 3) Now in their third decade of existence, The Band Of Holy Joy continue to intrigue and astound by entering their most prolific period yet with a whole slew of new releases and multi-media ventures. Martin Gray steels himself for the creative onslaught […]\nThe post The Band Of Holy Joy: celebrating their 40 years of recordings (part three) appeared first on Louder Than War.", "link": "https://louderthanwar.com/the-band-of-holy-joy-celebrating-their-40-years-of-recordings-part-three/", "source": "Louder Than War"},
{"title": "Vehicle: You Are Not A Cowboy – Single Review", "content": "Vehicle: You Are Not A Cowboy Vehicle Esco Romanesco Records Out now Since their fuzzier releases in 2024, the cult favourite garage rock of Vehicle has slotted neatly between art rock, ‘60s experimental pop and the leftfield glam for which Geese came to fame.   Vehicle’s debut album was among the closest a modern band […]\nThe post Vehicle: You Are Not A Cowboy – Single Review appeared first on Louder Than War.", "link": "https://louderthanwar.com/vehicle-you-are-not-a-cowboy-single-review/", "source": "Louder Than War"},
{"title": "Jaguar 777: Jaguar 777 – Album Review", "content": "Jaguar 777: Jaguar 777 (Eleventh Hour) LP | DL Out 6th February, 2026 Highly anticipated debut album from Jaguar 777 wraps their lustful Bad Seeds-meets-Suicide sounds in velvet-lined desires. Step enticed into their world. This album, or rather whisperings of this album, has been brewing for some time now, and finally, it is here. From […]\nThe post Jaguar 777: Jaguar 777 – Album Review appeared first on Louder Than War.", "link": "https://louderthanwar.com/jaguar-777-jaguar-777-album-review/", "source": "Louder Than War"},
{"title": "Wolfgang Flur (Kraftwerk) send generators to the Ukraine : an appreciation of an act of charity", "content": "Wolfgang Flur (Kraftwerk) send generators to the Ukraine\nThe post Wolfgang Flur (Kraftwerk) send generators to the Ukraine : an appreciation of an act of charity appeared first on Louder Than War.", "link": "https://louderthanwar.com/wolfgang-flur/", "source": "Louder Than War"},
{"title": "Marc Valentine: NY UAP – Single review", "content": "Marc Valentine: NY UAP (Wicked Cool Records) Stream Out now Marc Valentine kick starts the new year in fine style with his new single NY UAP. It’s another classic three minute blast of uplifting power pop from his forthcoming album that is guaranteed to lift your mood as soon as you hear it. With two […]\nThe post Marc Valentine: NY UAP – Single review appeared first on Louder Than War.", "link": "https://louderthanwar.com/marc-valentine-ny-uap-single-review/", "source": "Louder Than War"},
{"title": "Sly Dunbar : an appreciation", "content": "Sly Dunbar’s music career is an astonishing journey through many classic records with his rhythms changing the very sound and shape of music. John Brice worked with the legend and wrote this appreciation for him after his passing this week.   No musicologist, archivist or connoisseur in the world will ever be able to fully […]\nThe post Sly Dunbar : an appreciation appeared first on Louder Than War.", "link": "https://louderthanwar.com/sly-dunbar-an-appreciation/", "source": "Louder Than War"}
]
