[
{"title": "The Xcerts share new single, “do it to myself”", "content": "Today, The XCERTS return with their first original music since 2023, unveiling the anthemic new single “do it to myself”, their debut release for their new record label FLG Records. A...\nThe post The Xcerts share new single, “do it to myself” appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/news/the-xcerts-share-new-single-do-it-to-myself/", "source": "Soundsphere magazine"},
{"title": "Backline launches B-LINE: 24/7 mental health & crisis support for the music industry in America", "content": "Today, Backline launches B-LINE, a 24/7 mental health and crisis support line created exclusively for the music industry. B-LINE connects music professionals and their families with trained counselors who understand the unique pressures...\nThe post Backline launches B-LINE: 24/7 mental health & crisis support for the music industry in America appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/news/backline-launches-b-line-24-7-mental-health-crisis-support-for-the-music-industry-in-america/", "source": "Soundsphere magazine"},
{"title": "Enter Shikari announce headline November 2026 tour", "content": "The illustrious Enter Shikari have just announced a UK and EU headline arena tour for November, their biggest yet, and a headline run around Australia in May! The EU dates kick off...\nThe post Enter Shikari announce headline November 2026 tour appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/news/enter-shikari-announce-headline-november-2026-tour/", "source": "Soundsphere magazine"},
{"title": "The Hu release brand new single, ‘The Real You’", "content": "Innovative Mongolian rock group and global phenomenon The HU continue to push the limits of rock and bring the world along with them on their latest single “The Real You,” out today...\nThe post The Hu release brand new single, ‘The Real You’ appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/news/the-hu-release-brand-new-single-the-real-you/", "source": "Soundsphere magazine"},
{"title": "Violet Grohl signs to Republic, shares two new singles", "content": "Violet Grohl has officially inked with Republic Records through her imprint, Auroura Records. “From the moment we met Violet, it was clear that she represents the next generation of artists,” Kristina Grossmann, SVP...\nThe post Violet Grohl signs to Republic, shares two new singles appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/news/violet-grohl-signs-to-republic-shares-new-singles/", "source": "Soundsphere magazine"},
{"title": "Haggard Cat announce new album ‘The Pain That Orbits Life’", "content": "For their highly anticipated third full-length album, ‘The Pain That Orbits Life’ , Haggard Cat have teamed up with double Grammy award-winning producer Adrian Bushby to create their most accomplished...\nThe post Haggard Cat announce new album ‘The Pain That Orbits Life’ appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/news/haggard-cat-announce-new-album-the-pain-that-orbits-life/", "source": "Soundsphere magazine"},
{"title": "Chris Jericho discusses Fozzy’s plans for 2026, his own reinvention as an artist and musician", "content": "Chris Jericho is set for an incredible year in 2026. Here, he chats to Soundsphere’s Dom Smith about his plans for the rest of it, ageism in music and wrestling,...\nThe post Chris Jericho discusses Fozzy’s plans for 2026, his own reinvention as an artist and musician appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/spotlight/chris-jericho-discusses-fozzys-plans-for-2026-his-own-reinvention-as-an-artist-and-musician/", "source": "Soundsphere magazine"},
{"title": "Paerish unveil radically-transformed new version of ‘Still There’", "content": "French alternative / indie band Paerish are set to release a gorgeous collection of re-imaginings, titled ‘Acoustic Sessions – Live At L’Ancienne Abbaye Saint-Léger’ EP, on 27th February via SideOneDummy Records....\nThe post Paerish unveil radically-transformed new version of ‘Still There’ appeared first on Soundsphere magazine.", "link": "https://www.soundspheremag.com/news/paerish-unveil-radically-transformed-new-version-of-still-there/", "source": "Soundsphere magazine"}
]
